"Every 10 minutes" = "Her 10 dakikada bir";
"Manually" = "El İle";
"Rescan" = "Yeniden tara";
"Show Info" = "Bilgi Ver";
"Delete selected source" = "Seçili kaynağı sil";
"Every day" = "Her gün";
"Add source..." = "Kaynak ekle...";
"Every half hour" = "Her yarım saatte bir";
"Rescan source" = "Kaynağı yeniden tara";
"Sources" = "Kaynaklar";
"Every hour" = "Her saat";
"Rescan frequency" = "Yeniden tarama sıklığı";
